package j20211213;

public class ConstExam {
    /*
        생성자 : constructor 생성자는 클라스가 객체를 생성할 때 자동으로 객체를 생성하지마자 호출되는 일종
                의 메소드 
                객체를 찍을때 맨처음, 시작 하자마자
            1. 생성자는 클라스명과 동일해야만 한다.
            2. 생성자는 return 타입도 없고 return도 없다.
        
        기본 생성자 : default constructor 
            1. 아무 내용도/인수도/매개변수도 없는 이름만 존재라는 생성자.
            2. 모든 클래스에 존재한다. 생성자를 단 하나도 직접 만들지 않으면 자바가 자동으로 
               기본 생성자를 생성한다.
               그러나 생성자를 하나라도 개발자가 직접 만들면 자바가 기본생성자를 만들지 않는다.

    */
}
