package j20211213;

public class InherExam {
    /*
         상속 inheritance - 객체지양의꽃
        :자식 클래스, 부모 클래스 모든 것을 그대로 물려받을 수 있는 기능
        :상속은 부모의 기능을 확장하여(덧붙여서) 사용하는 역할이 주요 목적이다.
        :java는 다중 상속을 허용하지 않는다.

        method Overriding : 메소드 덮어쓰기(상속받은 부모가 가진 기능과 동일한 이름으로 자식 클래스에 다시 
                            만드는 매서드)
                            같은이름의 부모의 메서드를 무시하고 자식의 메서드를 사용

        method Overloding : 메소드 선택()
                            호출 할 때 인수의 갯수 또는 자료형의 타입에 따라 각기 다른 "동일한 이름의 메서드"가
                            실행 되도록 하는 기능
        생성자 오버로딩 constructor overloading
        : 일반 메서드의 오버로딩과 마찬가지로 생성자에 

    */


}
